Revit 2017 API
Railing.SetPath Method
 Sets the railing path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2017
Syntax
C#
public void SetPath(
	CurveLoop curveLoop
)
Visual Basic
Public Sub SetPath ( _
	curveLoop As CurveLoop _
)
Visual C++
public:
void SetPath(
	CurveLoop^ curveLoop
)
Parameters
curveLoop
Type: Autodesk.Revit.DB.CurveLoop
 The new curve array for the railing path. The curveLoop should be continuous with curves which are only bounded lines and arcs on the same horizontal plane.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  curveLoop is empty. -or- curveLoop should only contain lines or arcs. -or- curveLoop is not continuous. -or- Not all curves in curveLoop are on the same horizontal plane.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.InapplicableDataException |  The railing has incorrect internal data.
See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace